# 现有三个变量，分别为：a = 100，b = 200，c = 300，现需要将这三个变量值进行交换，将a,b,c的值分别赋值给c,a,b，并将其输出到控制台。
#
# a=100
# b=200
# c=300
# temp=a #temp=100
# a=b    #a=200
# b=c    #b=300
# c=temp
# print(a)
# print(b)
# print(c)

# 需求：根据用户输入的两个数字，计算两个数之和，并将其输出到控制台。
# a=int(input("请输入第一个数字"))
# b=int(input("请输入第二个数字"))
# c=a+b
# print(f"两数之和为{c}")
# 案例1：计算输入的三个整数的平均数
# 案例2：要求输入梯形的上底、下底、高，然后计算梯形的面积
# 案例3：要求输入圆的半径，然后计算圆的周长和面积 (周长: 2πr，面积：πr²)
# 案例4：身体质量指数BMI的计算（BMI = 体重(kg) / 身高(m)²）
# 输入体重(单位kg)
# 输入身高(单位m)
# 计算身体质量指数BMI并输出
#案例1：计算输入的三个整数的平均数
# a=int(input("输入第一个整数"))
# b=int(input("输入第二个整数"))
# c=int(input("输入第三个整数"))
# d=(a+b+c)/3
# print(f"三个整数的平均数为{d}")
# 案例2：要求输入梯形的上底、下底、高，然后计算梯形的面积
# a=float(input("输入梯形的上底"))
# b=float(input("输入梯形的下底"))
# h=float(input("输入梯形的高"))
# s=(a+b)*h/2
# print(f"梯形的面积为{s}")
# 案例3：要求输入圆的半径，然后计算圆的周长和面积 (周长: 2πr，面积：πr²)
# import math
# r=float(input("请输入圆的半径"))
# l=2*math.pi*r
# s=math.pi*r**2
# print(f"圆的周长为{l}")
# print(f"圆的面积为{s}")
# 案例4：身体质量指数BMI的计算（BMI = 体重(kg) / 身高(m)²）
# 输入体重(单位kg)
# 输入身高(单位m)
# 计算身体质量指数BMI并输出
# w=float(input("请输入体重"))
# h=float(input("请输入身高"))
# BMI=w/h**2
# print(f"BMI={BMI:.2f}")